Котельников_АБ_70153995/src/BusinessProcesses/ПодборПерсонала/ПодборПерсонала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПодборПерсонала</name>
  <task>Task.ЗадачаПодборПерсонала</task>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПодбор</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СогласованиеЗаявки</name>
    <type>
      <types>DocumentRef.СогласованиеЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОдобрена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаОтклонена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрацияКандидатов</name>
    <type>
      <types>DocumentRef.РегистрацияКандидатов</types>
    </type>
  </attributes>
  <attributes>
    <name>НайденыПодходящиеКандидаты</name>
    <type>
      <types>EnumRef.ВариантыОтветаНаВопрос</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытиеВакансии</name>
    <type>
      <types>DocumentRef.ЗакрытиеВакансии</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВакансию</name>
    <type>
      <types>DocumentRef.ЗатратыНаВакансию</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПоискКандидатов</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаПубликациюВакансии</name>
    <type>
      <types>EnumRef.ОтветственныеЗаПубликацию</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Котельников_АБ_70153995/src/Documents/ЗаявкаНаПодбор/ЗаявкаНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаПодбор</name>
  <basedOn>Catalog.ПрофилиДолжностей</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияЗаявокНаПодбор</registerRecords>
  <attributes>
    <name>ПланируемыйСрокЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявокНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОткрытияВакансии</name>
    <type>
      <types>EnumRef.ПричиныОткрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВакантнаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДолжности</name>
    <type>
      <types>EnumRef.КатегорииДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧеловек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильДолжности</name>
    <type>
      <types>CatalogRef.ПрофилиДолжностей</types>
    </type>
  </attributes>
  <attributes>
    <name>Образование</name>
    <type>
      <types>EnumRef.УровниОбразования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОпытРаботы</name>
    <type>
      <types>EnumRef.ОпытРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностныеОбязанности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Требования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Условия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>EnumRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматРаботы</name>
    <type>
      <types>EnumRef.ФорматыРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОплатаТрудаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоВычетаНалога</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКЗаявке</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетПоиска</name>
    <type>
      <types>EnumRef.ПриоритетыПоиска</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КлючевыеНавыки</name>
    <attributes>
      <name>Навык</name>
      <type>
        <types>CatalogRef.КлючевыеНавыки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниПрофессиональныхНавыков</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛичныеКачества</name>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.ЛичныеКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗнанияЯзыков</name>
    <attributes>
      <name>Язык</name>
      <type>
        <types>CatalogRef.Языки</types>
      </type>
    </attributes>
    <attributes>
      <name>УровеньВладения</name>
      <type>
        <types>EnumRef.УровниЗнанийЯзыков</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/СогласованиеЗаявки/СогласованиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласованиеЗаявки</name>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отклонена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеПричины</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/РегистрацияКандидатов/РегистрацияКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияКандидатов</name>
  <basedOn>Document.Вакансия</basedOn>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Кандидаты</name>
    <attributes>
      <name>ДатаПоступления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кандидат</name>
      <type>
        <types>CatalogRef.Кандидаты</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникПривлечения</name>
      <type>
        <types>CatalogRef.ИсточникиПривлечения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОткликОтКандидата</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уведомлен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/Documents/ПроведениеСобеседования/ПроведениеСобеседования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроведениеСобеседования</name>
  <registerRecords>InformationRegister.СтатусыКандидатов</registerRecords>
  <registerRecords>AccumulationRegister.КоличествоКандидатовПоЭтапам</registerRecords>
  <attributes>
    <name>ТипСобеседования</name>
    <type>
      <types>EnumRef.ТипыСобеседований</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСобеседования</name>
    <type>
      <types>EnumRef.СтатусыСобеседований</types>
    </type>
  </attributes>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСобеседования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кандидат</name>
    <type>
      <types>CatalogRef.Кандидаты</types>
    </type>
  </attributes>
  <attributes>
    <name>КандидатУведомлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатСобеседования</name>
    <type>
      <types>EnumRef.РезультатыСобеседования</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРезультата</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтветственныеЛицаЗаСобеседование</name>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Котельников_АБ_70153995/src/BusinessProcesses/ПодборПерсонала/Forms/ФормаБизнесПроцесса/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ИнициаторЗаявки = ПолучитьТекСотрудника();	
	КонецЕсли;
	
	ЭлементОтбора = Кандидаты.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Вакансия");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Вакансия;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьКартуМаршрута();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьКартуМаршрута();
	Если Объект.Стартован Тогда
		ОповеститьОбИзменении(Тип("ЗадачаСсылка.ЗадачаПодборПерсонала"));	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекСотрудника()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Сотрудник.Ссылка КАК Сотрудник
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();

	Возврат Выборка.Сотрудник;
		
КонецФункции

&НаСервере
Процедура ОбновитьКартуМаршрута()

	БизнесПроцессОбъект = РеквизитФормыВЗначение("Объект");
	КартаМаршрута = БизнесПроцессОбъект.ПолучитьКартуМаршрута(); 	

КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаПодборНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ИнициаторЗаявки", ПолучитьТекСотрудника());
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.ЗаявкаНаПодбор.ФормаВыбора", ПараметрыОтбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеЗаявкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ИнициаторЗаявки", ПолучитьТекСотрудника());
	Отбор.Вставить("Заявка", Объект.ЗаявкаНаПодбор);
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);
	
	ОткрытьФорму("Документ.СогласованиеЗаявки.ФормаВыбора", ПараметрыОтбора, Элемент); 	
	
КонецПроцедуры

&НаКлиенте
Процедура СогласованиеЗаявкиСоздание(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.ЗаявкаНаПодбор);
	ОткрытьФорму("Документ.СогласованиеЗаявки.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВакансияСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.СогласованиеЗаявки);
	ОткрытьФорму("Документ.Вакансия.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВакансияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ДокументОснование", Объект.СогласованиеЗаявки);	
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);	
	ОткрытьФорму("Документ.Вакансия.ФормаВыбора", ПараметрыОтбора, Элемент); 		
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияКандидатовСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.Вакансия);
	ОткрытьФорму("Документ.РегистрацияКандидатов.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ Объект.РегистрацияКандидатов.Пустая() И Объект.НайденыПодходящиеКандидаты.Пустая() Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиент.ВывестиСообщение("Заполните реквизит ""Найдены подходящие кандидаты""", "Объект.НайденыПодходящиеКандидаты");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеВакансииСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.Вакансия);
	ОткрытьФорму("Документ.ЗакрытиеВакансии.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеВакансииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Вакансия", Объект.Вакансия);	
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);	
	ОткрытьФорму("Документ.ЗакрытиеВакансии.ФормаВыбора", ПараметрыОтбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНаВакансиюСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Основание", Объект.Вакансия);
	ОткрытьФорму("Документ.ЗатратыНаВакансию.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыНаВакансиюНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("Вакансия", Объект.Вакансия);	
	ПараметрыОтбора = Новый Структура("Отбор", Отбор);	
	ОткрытьФорму("Документ.ЗатратыНаВакансию.ФормаВыбора", ПараметрыОтбора, Элемент); 
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСобеседование(Команда)
	
	ОчиститьСообщения();
	
	Если Объект.Вакансия.Пустая() Тогда
		ОбщегоНазначенияКлиент.ВывестиСообщение("Вакансия не выбрана", "Объект.Вакансия");
		Возврат;
	КонецЕсли;
		
	ЗначенияЗаполнения = Новый Структура("Вакансия", Объект.Вакансия);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ПроведениеСобеседования.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьДанныеКандидата(Команда)
	
	Если ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрока = ЭтотОбъект.ТекущийЭлемент.ТекущиеДанные.Кандидат;
	
	ПараметрыФормы = Новый Структура("Ключ", ТекСтрока);
	ОткрытьФорму("Справочник.Кандидаты.Форма.ФормаЭлемента", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНаПодборПриИзменении(Элемент)
	
	Объект.КоличествоЧеловек = ПолучитьКоличествоЧеловек(Объект.ЗаявкаНаПодбор);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКоличествоЧеловек(Заявка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаПодбор.КоличествоЧеловек КАК КоличествоЧеловек
		|ИЗ
		|	Документ.ЗаявкаНаПодбор КАК ЗаявкаНаПодбор
		|ГДЕ
		|	ЗаявкаНаПодбор.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Заявка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.КоличествоЧеловек;

КонецФункции
